import os

# Пытаемся получить токен из переменных окружения Railway
BOT_TOKEN = os.getenv("BOT_TOKEN", "8422033699:AAEoLcJq-LrKD6Su9Vtg4sNDf0v7IL5XRus")

# Твой Telegram ID
ADMIN_ID = 6056106251

# Меню ресторана
MENU = {
    "burgers": {
        "🍔 Классический бургер": 350,
        "🍔 Чизбургер": 400,
        "🍔 Биг Бургер": 500
    },
    "pizza": {
        "🍕 Маргарита": 550,
        "🍕 Пепперони": 600,
        "🍕 Гавайская": 650
    },
    "sushi": {
        "🍣 Филадельфия": 700,
        "🍣 Калифорния": 650,
        "🍣 Ролл с угрем": 800
    }
}
